routes/web.php

Route::get('posts/{post:slug}', [PostController::class, 'show']);

Route::get('/categories', function(){
    return view('categories', [
        'title' => 'Post Cateories',
        'categories' => Category::all()
    ]);
});
Route::get('/categories/{category:slug}', function(Category $category) {
    return view('posts',[
        'title' => "Post By : $category->name",
        'posts' => $category->posts->load('category', 'user'),
    ]);
---
SELECT * FROM `categories`
SELECT * FROM `posts` WHERE `posts`.`category_id` = '1' and `posts`.`category_id` IS not NULL
SELECT * FROM `categories` WHERE `categories`.`id` in (2)
SELECT * FROM `posts` WHERE `posts`.`category_id` = '2' and `posts`.`category_id` IS not NULL
SELECT * FROM `users` WHERE `users`.`id` in (1, 2, 3, 5, 6, 7, 9, 10)

Route::get('/authors/{author:username}', function(User $author) {
    return view('posts', [
        'title' => 'User Post',
        'posts' => $author->posts->load('category', 'user'),
---
SELECT * FROM `categories` WHERE `categories`.`id` in (1, 2, 3)
SELECT * FROM `posts` WHERE `posts`.`user_id` = '9' and `posts`.`user_id` IS not NULL
SELECT * FROM `users` WHERE `users`.`id` in (9)