app/Http/Controllers/PostController.php

    public function index()
    {
        return view('posts', [
            "title" => "All Post",
            "posts" => Post::with(['user', 'category'])->latest()->get()
---
SELECT * FROM `categories` WHERE `categories`.`id` in (1, 2, 3)
SELECT * FROM `posts` ORDER BY `created_at` DESC
SELECT * FROM `users` WHERE `users`.`id` in (1, 2, 3)